cases/uniformCoalescence/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0  0   0)
    (1  0   0)
    (1  1   0)
    (0  1   0)
    (0  0   1)
    (1  0   1)
    (1  1   1)
    (0  1   1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    empties
    {
        type empty;
        faces
        (
            (3 2 1 0)
            (4 5 6 7)
            (5 1 2 6)
            (0 4 7 3)
            (3 7 6 2)
            (0 1 5 4)
        );
    }
);
