cases/uniformCoalescence/constant/thermophysicalProperties.bubbles
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.bubbles;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.97;
    }
    thermodynamics
    {
        Cp          1007;
        Hf          0;
    }
    equationOfState
    {
        rho         2.8733;
    }
    transport
    {
        mu          1.77e-05;
        Pr          0.71;
    }
}
