cases/uniformCoalescence/0.orig/U.droplets
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.droplets;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    empties
    {
        type            empty;
    }
}
