cases/uniformCoalescence/0.orig/T.droplets
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.water;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    empties
    {
        type            empty;
    }
}
