cases/uniformCoalescence/0.orig/alpha.droplets
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.droplets;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    empties
    {
        type            empty;
    }
}
