cases/uniformCoalescence/0.orig/kappa.bubbles
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      kappa.bubbles;
}

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    empties
    {
        type            empty;
    }
}
